Res-firecracker-set-v66/firecracker_t_10_c_30_frontVcpu_2_wrkVcpu_2/wrk.txt
Running 1m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 5128.632ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 4890.499ms, rate sampling interval: 17760ms
  Thread calibration: mean lat.: 5125.855ms, rate sampling interval: 17907ms
  Thread calibration: mean lat.: 4975.759ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 3432.690ms, rate sampling interval: 14032ms
  Thread calibration: mean lat.: 5124.972ms, rate sampling interval: 18481ms
  Thread calibration: mean lat.: 4154.461ms, rate sampling interval: 16924ms
  Thread calibration: mean lat.: 5022.460ms, rate sampling interval: 17891ms
  Thread calibration: mean lat.: 5051.908ms, rate sampling interval: 17973ms
  Thread calibration: mean lat.: 5002.952ms, rate sampling interval: 17760ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    31.12s    13.90s    0.97m    61.76%
    Req/Sec   227.52      5.88   238.00     80.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   30.18s 
 75.000%   41.78s 
 90.000%    0.86m 
 99.000%    0.97m 
 99.900%    0.99m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.215     0.000000            1         1.00
   13000.703     0.100000        11469         1.11
   18006.015     0.200000        22951         1.25
   22495.231     0.300000        34404         1.43
   25903.103     0.400000        45890         1.67
   30179.327     0.500000        57325         2.00
   32309.247     0.550000        63075         2.22
   34275.327     0.600000        68831         2.50
   36470.783     0.650000        74544         2.86
   38895.615     0.700000        80304         3.33
   41779.199     0.750000        86019         4.00
   43319.295     0.775000        88844         4.44
   44892.159     0.800000        91715         5.00
   46563.327     0.825000        94587         5.71
   48103.423     0.850000        97471         6.67
   49709.055     0.875000       100344         8.00
   50528.255     0.887500       101733         8.89
   51445.759     0.900000       103189        10.00
   52363.263     0.912500       104639        11.43
   53215.231     0.925000       106068        13.33
   54067.199     0.937500       107485        16.00
   54558.719     0.943750       108207        17.78
   55050.239     0.950000       108922        20.00
   55476.223     0.956250       109625        22.86
   55967.743     0.962500       110370        26.67
   56492.031     0.968750       111077        32.00
   56786.943     0.971875       111433        35.56
   57049.087     0.975000       111770        40.00
   57311.231     0.978125       112137        45.71
   57573.375     0.981250       112484        53.33
   57868.287     0.984375       112877        64.00
   57999.359     0.985938       113042        71.11
   58163.199     0.987500       113221        80.00
   58327.039     0.989062       113410        91.43
   58490.879     0.990625       113585       106.67
   58654.719     0.992188       113749       128.00
   58720.255     0.992969       113839       142.22
   58785.791     0.993750       113921       160.00
   58884.095     0.994531       114020       182.86
   58982.399     0.995313       114099       213.33
   59080.703     0.996094       114194       256.00
   59146.239     0.996484       114266       284.44
   59179.007     0.996875       114285       320.00
   59244.543     0.997266       114342       365.71
   59277.311     0.997656       114363       426.67
   59342.847     0.998047       114416       512.00
   59375.615     0.998242       114437       568.89
   59408.383     0.998437       114457       640.00
   59441.151     0.998633       114480       731.43
   59473.919     0.998828       114503       853.33
   59539.455     0.999023       114523      1024.00
   59572.223     0.999121       114537      1137.78
   59604.991     0.999219       114562      1280.00
   59604.991     0.999316       114562      1462.86
   59604.991     0.999414       114562      1706.67
   59637.759     0.999512       114576      2048.00
   59670.527     0.999561       114583      2275.56
   59670.527     0.999609       114583      2560.00
   59703.295     0.999658       114591      2925.71
   59736.063     0.999707       114598      3413.33
   59768.831     0.999756       114611      4096.00
   59768.831     0.999780       114611      4551.11
   59768.831     0.999805       114611      5120.00
   59768.831     0.999829       114611      5851.43
   59768.831     0.999854       114611      6826.67
   59801.599     0.999878       114622      8192.00
   59801.599     0.999890       114622      9102.22
   59801.599     0.999902       114622     10240.00
   59801.599     0.999915       114622     11702.86
   59801.599     0.999927       114622     13653.33
   59801.599     0.999939       114622     16384.00
   59801.599     0.999945       114622     18204.44
   59801.599     0.999951       114622     20480.00
   59834.367     0.999957       114627     23405.71
   59834.367     1.000000       114627          inf
#[Mean    =    31118.799, StdDeviation   =    13902.015]
#[Max     =    59801.600, Total count    =       114627]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  136923 requests in 1.00m, 56.71MB read
  Socket errors: connect 0, read 0, write 0, timeout 24
Requests/sec:   2281.78
Transfer/sec:      0.95MB